In [1]:
import pandas as pd

# Normalization/ Min Max Scaller

In [2]:
df_For_Normalization = pd.read_csv("agora.csv")

In [61]:
df_For_Normalization.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         8.463083        8.258720  10.000000    Dhaka  192261.83
1         9.916797        8.809859   9.704467      Ctg  191792.06
2         9.639923        6.897895   9.323318  Rangpur  191050.39
3         9.365682        7.564992   9.061176    Dhaka  182901.99
4         9.297189        6.526640   8.880678  Rangpur  166187.94

In [4]:
from sklearn.preprocessing import MinMaxScaler

In [5]:
N = MinMaxScaler(feature_range=(5,10))

In [6]:
df_For_Normalization["Marketing Spend"] = N.fit_transform(df_For_Normalization[["Marketing Spend"]])#traning and transforming for Marketing Spend colum

In [7]:
df_For_Normalization.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         8.463083       136897.80  471784.10    Dhaka  192261.83
1         9.916797       151377.59  443898.53      Ctg  191792.06
2         9.639923       101145.55  407934.54  Rangpur  191050.39
3         9.365682       118671.85  383199.62    Dhaka  182901.99
4         9.297189        91391.77  366168.42  Rangpur  166187.94

In [8]:
ad_fit_normalization = N.fit(df_For_Normalization[["Administration"]])# training administration

In [9]:
ad_fit_normalization

MinMaxScaler(feature_range=(5, 10))

In [10]:
df_For_Normalization["Administration"]=N.transform(df_For_Normalization[["Administration"]])#transform administration

In [11]:
df_For_Normalization.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         8.463083        8.258720  471784.10    Dhaka  192261.83
1         9.916797        8.809859  443898.53      Ctg  191792.06
2         9.639923        6.897895  407934.54  Rangpur  191050.39
3         9.365682        7.564992  383199.62    Dhaka  182901.99
4         9.297189        6.526640  366168.42  Rangpur  166187.94

In [12]:
df_For_Normalization["Transport"] = N.fit_transform(df_For_Normalization[["Transport"]])

In [13]:
df_For_Normalization.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         8.463083        8.258720  10.000000    Dhaka  192261.83
1         9.916797        8.809859   9.704467      Ctg  191792.06
2         9.639923        6.897895   9.323318  Rangpur  191050.39
3         9.365682        7.564992   9.061176    Dhaka  182901.99
4         9.297189        6.526640   8.880678  Rangpur  166187.94

# Standardization

In [14]:
df_for_Standardization = pd.read_csv("agora.csv")

In [15]:
from sklearn.preprocessing import StandardScaler

In [16]:
S =StandardScaler()

In [17]:
df_for_Standardization["Marketing Spend"]= S.fit_transform(df_for_Standardization[["Marketing Spend"]])

In [18]:
df_for_Standardization["Marketing Spend"].head()

0    0.897913
1    1.955860
2    1.754364
3    1.554784
4    1.504937
Name: Marketing Spend, dtype: float64

In [19]:
df_for_Standardization["Administration"]= S.fit_transform(df_for_Standardization[["Administration"]])

In [20]:
df_for_Standardization.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753  471784.10    Dhaka  192261.83
1         1.955860        1.082807  443898.53      Ctg  191792.06
2         1.754364       -0.728257  407934.54  Rangpur  191050.39
3         1.554784       -0.096365  383199.62    Dhaka  182901.99
4         1.504937       -1.079919  366168.42  Rangpur  166187.94

In [21]:
df_for_Standardization["Transport"]= S.fit_transform(df_for_Standardization[["Transport"]])

In [22]:
df_for_Standardization.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753   2.165287    Dhaka  192261.83
1         1.955860        1.082807   1.929843      Ctg  191792.06
2         1.754364       -0.728257   1.626191  Rangpur  191050.39
3         1.554784       -0.096365   1.417348    Dhaka  182901.99
4         1.504937       -1.079919   1.273550  Rangpur  166187.94

# Max Absulate Scaler

In [24]:
df_for_Max_Absulate_Scaler = pd.read_csv("agora.csv")

In [28]:
abs_Marketing_Spend = df_for_Max_Absulate_Scaler["Marketing Spend"].abs()

In [31]:
max_Marketing_Spend =abs_Marketing_Spend.max()

In [33]:
df_for_Max_Absulate_Scaler["Marketing Spend"] =df_for_Max_Absulate_Scaler["Marketing Spend"]/max_Marketing_Spend

In [35]:
df_for_Max_Absulate_Scaler.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

In [36]:
abs_Administration = df_for_Max_Absulate_Scaler["Administration"].abs()

In [37]:
max_Administration  =abs_Administration.max()

In [40]:
df_for_Max_Absulate_Scaler["Administration"] =df_for_Max_Absulate_Scaler["Administration"]/max_Administration

In [41]:
df_for_Max_Absulate_Scaler.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.749527  471784.10    Dhaka  192261.83
1         0.983359        0.828805  443898.53      Ctg  191792.06
2         0.927985        0.553781  407934.54  Rangpur  191050.39
3         0.873136        0.649738  383199.62    Dhaka  182901.99
4         0.859438        0.500378  366168.42  Rangpur  166187.94

In [42]:
abs_transport = df_for_Max_Absulate_Scaler["Transport"].abs()

In [43]:
max_transport =abs_transport.max()

In [46]:
df_for_Max_Absulate_Scaler["Transport"]= df_for_Max_Absulate_Scaler["Transport"]/max_transport

In [48]:
df_for_Max_Absulate_Scaler.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.749527   1.000000    Dhaka  192261.83
1         0.983359        0.828805   0.940893      Ctg  191792.06
2         0.927985        0.553781   0.864664  Rangpur  191050.39
3         0.873136        0.649738   0.812235    Dhaka  182901.99
4         0.859438        0.500378   0.776136  Rangpur  166187.94

# Robust Scaler

In [51]:
df_for_Robus_scaler = pd.read_csv("agora.csv")

In [49]:
from sklearn.preprocessing import RobustScaler

In [52]:
R = RobustScaler()

In [55]:
df_for_Robus_scaler["Marketing Spend"] = R.fit_transform(df_for_Robus_scaler[["Marketing Spend"]])

In [56]:
df_for_Robus_scaler.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530       136897.80  471784.10    Dhaka  192261.83
1         1.452113       151377.59  443898.53      Ctg  191792.06
2         1.303634       101145.55  407934.54  Rangpur  191050.39
3         1.156567       118671.85  383199.62    Dhaka  182901.99
4         1.119836        91391.77  366168.42  Rangpur  166187.94

In [57]:
df_for_Robus_scaler["Administration"] = R.fit_transform(df_for_Robus_scaler[["Administration"]])

In [58]:
df_for_Robus_scaler["Transport"] = R.fit_transform(df_for_Robus_scaler[["Transport"]])

In [60]:
df_for_Robus_scaler.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530        0.345355   1.552016    Dhaka  192261.83
1         1.452113        0.697565   1.383714      Ctg  191792.06
2         1.303634       -0.524290   1.166654  Rangpur  191050.39
3         1.156567       -0.097977   1.017368    Dhaka  182901.99
4         1.119836       -0.761543   0.914576  Rangpur  166187.94